Revit 2024 API
NumericRevisionSettings Constructor (Int32, String, String)
 Constructs a NumericRevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public NumericRevisionSettings(
	int startNumber,
	string prefix,
	string suffix
)
Visual Basic
Public Sub New ( _
	startNumber As Integer, _
	prefix As String, _
	suffix As String _
)
Visual C++
public:
NumericRevisionSettings(
	int startNumber,
	String^ prefix,
	String^ suffix
)
Parameters
startNumber
Type: System.Int32
 The start number for the sequence.
prefix
Type: System.String
 The prefix string for each revision number in the sequence.
suffix
Type: System.String
 The suffix string for each revision number in the sequence.
Remarks
 The starting number parameter accepts any non-negative integer, and the prefix and suffix strings are allowed to be empty.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for startNumber is negative.
See Also
NumericRevisionSettings Class
NumericRevisionSettings Overload
Autodesk.Revit.DB Namespace